# FamilyManager Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyManager Class
Members See Also
---
The family manager object to manage the family types and parameters in family document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class FamilyManager : APIObject
```

Visual Basic
---
```text
Public Class FamilyManager _
	Inherits APIObject
```

Visual C++
---
```text
public ref class FamilyManager : public APIObject
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..FamilyManager
# See Also
FamilyManager Members
Autodesk.Revit.DB Namespace